In [25]:
import pandas as pd

from Teil_Python.pandas.pd_exercises.pd_exercises import older_passengers

df = pd.read_csv("Titanic-Dataset.csv")
print(df.head(5))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [5]:
#Exercise 1
#Number of rows of the dataframe
var = len(df)
print(var)

891

In [8]:
#Exercise 2
#List all attributes of the dataset
col = df.columns.tolist()

print(col)
print(df.info())

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [16]:
#Exercise 3
#Age of youngest passenger
#mit skipna = True werden NaN-Werte ignoriert
#Ohne print, wird auch der Datentyp des Werts angezeigt
df['Age'].min(skipna=True)

np.float64(0.42)

In [17]:
#Exercise 4
#Age of oldest passenger
df['Age'].max(skipna=True)

np.float64(80.0)

In [23]:
#Exercise 5
#Average age of all passengers (rounded to 2 decimal places)
round(df['Age'].mean(),2)
float(format(df['Age'].mean(), ".2f"))

np.float64(29.7)

In [26]:
#Exercise 6
#Fare which was paid most often
#mode = Modus
#dropna löscht alle Zeilen mit min. ein NaN-Wert
df['Fare'].mode(dropna=True)

0    8.05
Name: Fare, dtype: float64

In [28]:
#Exercise 7
#Names and ages of the passengers older than 70 years
#Number of the passengers older than 70 years
older_70 = df.loc[df['Age'] > 70, ['Name','Age']]
count_older_70 = len(older_70)
print("Count older than 70:",count_older_70)
older_70

Count older than 70: 5

                                     Name   Age
96              Goldschmidt, Mr. George B  71.0
116                  Connors, Mr. Patrick  70.5
493               Artagaveytia, Mr. Ramon  71.0
630  Barkworth, Mr. Algernon Henry Wilson  80.0
851                   Svensson, Mr. Johan  74.0

In [32]:
#Exercise 8
#Names and ages of the passengers older than 70 years sorted by name in ascending order
older_70 = df.loc[df['Age'] > 70, ['Name', 'Age']]
older_passengers = older_70.sort_values(by=['Name'], ascending=True)
older_passengers

                                     Name   Age
493               Artagaveytia, Mr. Ramon  71.0
630  Barkworth, Mr. Algernon Henry Wilson  80.0
116                  Connors, Mr. Patrick  70.5
96              Goldschmidt, Mr. George B  71.0
851                   Svensson, Mr. Johan  74.0

In [49]:
#Exercise 9
#PassenderId and Name of all male passengers embarking from Southhampton (abbreviation 'S')
print(df['Sex'].unique())
print(df['Embarked'].unique())
males_from_s = df.loc[(df['Sex'] == 'male') & (df['Embarked'] == 'S'),['PassengerId','Name']]
males_from_s

#Eine Klammer -> 1 Spalte (Series)
#2 Klammern -> Mehrere Spalten (DataFrame)
#males_from_s[['PassengerId','Name']]

['male' 'female']
['S' 'C' 'Q' nan]

     PassengerId                            Name
0              1         Braund, Mr. Owen Harris
4              5        Allen, Mr. William Henry
6              7         McCarthy, Mr. Timothy J
7              8  Palsson, Master. Gosta Leonard
12            13  Saundercock, Mr. William Henry
..           ...                             ...
878          879              Laleff, Mr. Kristo
881          882              Markun, Mr. Johann
883          884   Banfield, Mr. Frederick James
884          885          Sutehall, Mr. Henry Jr
886          887           Montvila, Rev. Juozas

[441 rows x 2 columns]

In [50]:
#Exercise 10
#Like exercise 9, only the first 20 passengers
males_from_s = df[(df['Sex'] == 'male') & (df['Embarked'] == 'S')]
males_from_s[['PassengerId','Name']].head(20)

    PassengerId                                Name
0             1             Braund, Mr. Owen Harris
4             5            Allen, Mr. William Henry
6             7             McCarthy, Mr. Timothy J
7             8      Palsson, Master. Gosta Leonard
12           13      Saundercock, Mr. William Henry
13           14         Andersson, Mr. Anders Johan
17           18        Williams, Mr. Charles Eugene
20           21                Fynney, Mr. Joseph J
21           22               Beesley, Mr. Lawrence
23           24        Sloper, Mr. William Thompson
27           28      Fortune, Mr. Charles Alexander
29           30                 Todoroff, Mr. Lalio
33           34               Wheadon, Mr. Edward H
35           36      Holverson, Mr. Alexander Oskar
37           38            Cann, Mr. Ernest Charles
45           46            Rogers, Mr. William John
50           51          Panula, Master. Juha Niilo
51           52        Nosworthy, Mr. Richard Cater
55           56                   Woolner, Mr. Hugh
59           60  Goodwin, Master. William Frederick

In [56]:
#Exercise 11
print(df['Survived'].unique())

oldest_age = df['Age'].max()
print(oldest_age)

oldest_survivor = df.loc[(df['Age'] == oldest_age) & (df['Survived'] == 1),['Name','Age','Sex','Survived']]
oldest_survivor

[0 1]
80.0

                                     Name   Age   Sex  Survived
630  Barkworth, Mr. Algernon Henry Wilson  80.0  male         1

In [58]:
#Exercise 11
#Wie in den Lösungen

survivors = df[df['Survived'] == 1]
# df["Age"].max()        # gives 80.0 (the oldest age)
# df["Age"].idxmax()     # gives 630 (the row index of that passenger)
oldest_survivor = survivors.loc[survivors['Age'].idxmax(),]
oldest_survivor[['Name','Age','Sex','Survived']]

Name        Barkworth, Mr. Algernon Henry Wilson
Age                                         80.0
Sex                                         male
Survived                                       1
Name: 630, dtype: object

In [64]:
#Exercise 12
#What is the total number of passengers from each class who survived?
print(df['Pclass'].unique())

survivors_by_class = df[df['Survived'] == 1].groupby('Pclass').size().rename('SurvivorCount')
survivors_by_class

[3 1 2]

Pclass
1    136
2     87
3    119
Name: SurvivorCount, dtype: int64

In [65]:
#Exercise 13
#What was the average fare for male vs female passengers from each embarkment harbor

ave = df.groupby(['Embarked', 'Sex'])['Fare'].mean()
ave

Embarked  Sex
C         female    75.169805
          male      48.262109
Q         female    12.634958
          male      13.838922
S         female    38.740929
          male      21.711996
Name: Fare, dtype: float64

In [67]:
#Exercise 14
#What was the average age for each Passenger class (rounden to one decimal point)?
aveAge = df.groupby(['Pclass'])['Age'].mean().round(1)
aveAge

Pclass
1    38.2
2    29.9
3    25.1
Name: Age, dtype: float64

In [69]:
#Exercise 15
#Use .query() to filter all passenger (male and female) younger than 20. Give the first 20 and return their names.
younger_than_20 = df.query("Age < 20")['Name'].head(20)
younger_than_20

7                    Palsson, Master. Gosta Leonard
9               Nasser, Mrs. Nicholas (Adele Achem)
10                  Sandstrom, Miss. Marguerite Rut
14             Vestrom, Miss. Hulda Amanda Adolfina
16                             Rice, Master. Eugene
22                      McGowan, Miss. Anna "Annie"
24                    Palsson, Miss. Torborg Danira
27                   Fortune, Mr. Charles Alexander
38               Vander Planke, Miss. Augusta Maria
39                      Nicola-Yarred, Miss. Jamila
43         Laroche, Miss. Simonne Marie Anne Andree
44                    Devaney, Miss. Margaret Delia
49    Arnold-Franchi, Mrs. Josef (Josefine Franchi)
50                       Panula, Master. Juha Niilo
58                     West, Miss. Constance Mirium
59               Goodwin, Master. William Frederick
63                            Skoog, Master. Harald
67                         Crease, Mr. Ernest James
68                  Andersson, Miss. Erna Alexandra
71                       Goodwin, Miss. Lillian Amy
Name: Name, dtype: object

In [71]:
#Exercise 16
#For each passenger class, calculate average age, minimum age, and maximum fare
grouping = df.groupby('Pclass').agg({
    "Age": ["mean","min"],
    "Fare": "max"
})
grouping

              Age            Fare
             mean   min       max
Pclass
1       38.233441  0.92  512.3292
2       29.877630  0.67   73.5000
3       25.140620  0.42   69.5500